{
  "Abyss": {
    "image": "https://mechamonarch.com/wp-content/uploads/ABYSS.jpg",
    "used_against": [],
    "countered_by": [
      "Melting Point"
    ],
    "how_to_play": "Coming soon (as well as a update for the whole site!)\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": ""
  },
  "Melting Point": {
    "image": "https://mechamonarch.com/wp-content/uploads/MeltingPoint.jpg",
    "used_against": [
      "Fortress",
      "Rhino",
      "Vulcan",
      "Wraith",
      "War Factory",
      "Scorpion",
      "Typhoon"
    ],
    "countered_by": [
      "Steel Ball",
      "Crawler",
      "Marksman",
      "Phoenix",
      "Stormcaller",
      "Hacker"
    ],
    "how_to_play": "Used against high health units. This could include enemy giants like Fortress or Vulcan or medium sized units with high levels and items like super heavy armor. Should be your standard response when you see a Fortress, sometimes if you see a War Factory or a Vulcan. Usable against Wraiths and Overlords also. They scale very well into the late game with having the option to go crawler summoning and/or EMP barrage.\n\nvideo\n\nvideo end\n\nAssman Deskmat Check Price\n\nWhy promotions?",
    "how_to_counter": "Melting points rely on connecting on a high value target. Distracting them is the best immediate option. Usually the enemy pairs the Melting Points with Vulcans or any other sort of fast chaff clear, so going Sledge Hammers or Steel Balls to block the damage is a good play. Steel Balls in general are the hard counter to melting points, since they can tank the damage for your giants to do work, or they can actually kill the Melters if you tech them a bit. The are quite good even against multi beam melters because you can go range + energy absorption on them and they heal more than the melter does damage. Hackers work also great against the Melting Points, not because you can hack them but because you hack the small stuff and the Melting Point keeps retargeting all the time and this will buy time for your other units like Fortresses to clear the melting points (usually there's a reason why a Melting Points is deployed - like you building a fort)."
  },
  "Hound": {
    "image": "https://mechamonarch.com/wp-content/uploads/hound.jpg",
    "used_against": [
      "Crawler",
      "Fang"
    ],
    "countered_by": [
      "Fire Badger",
      "Rhino",
      "Scorpion",
      "Raiden",
      "Typhoon",
      "Vulcan",
      "Wraith",
      "Sandworm"
    ],
    "how_to_play": "The hound pairs very well with all late game compositions and is thus a premium unit. It having the ability to clear chaff very well and provide multiple bodies is a valuable thing later in the game because it will protect your bigger units from Melting points especially and help your bigger units to connect faster. Even if you use them early game without technologies and choose not to commit into them, they are nice to have later on. Pairs well with everything but especially well with Overlords, Raidens and War Factories. They are strong to commit into early because the level fast and with levels they can break out of their role and start clearing bigger units. Usually you want to tech range early (like r3) and mech rage later if the enemy deals with the hounds poorly. The fire technology is risky since it's countered very heavily by anti-missile technologies and devices. Even one device stops one hound from igniting an oil.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nPC Gaming Headset Headphone Hook Holder Check Price\n\nWhy promotions?",
    "how_to_counter": "Against aggressive hounds wraith or vulcan is the best option. Fire badgers and even mustangs work as well but are countered by the hound armor. If you see enemy going fire hounds early, go anti-missile mustangs immediately. Wasps are generally a good idea vs hounds since they force the enemy composition into a direction they don't want to go in. Wasps are also amazing vs hound flanks."
  },
  "Crawler": {
    "image": "https://mechamonarch.com/wp-content/uploads/Crawler.jpg",
    "used_against": [
      "Fang",
      "Hacker",
      "Marksman",
      "Melting Point",
      "Steel Ball",
      "Stormcaller",
      "Sabertooth",
      "Scorpion"
    ],
    "countered_by": [
      "Arclight",
      "Vulcan",
      "Rhino",
      "Wraith",
      "Sledgehammer",
      "Fire Badger",
      "Typhoon",
      "Tarantula"
    ],
    "how_to_play": "The crawler is the most versatile unit in the game. They are always useful as well placed crawlers will win you early game and packs of crawlers distract enemies in late game for a long time. After the enemy has developed good counters for your crawlers, you can protect most of them by placing tanky units in the line of fire before them. This way enemy Vulcans or what not will lock onto your Sledges or Steel Balls and the crawlers will roam free once again. They are a very aggressive unit that do well in flanks. And even back deployed crawlers are so fast they are in time for battle even if you are the one pushing. Crawlers are easy to drip feed into the battle to protect your higher value units because of their high movement speed. Their usual use case is just to take enemy fire and pull key enemy units away from certain positions. But they are dangerous with technologies. You can poke around the enemy defenses a bit with cheap crawlers and if you see an opening you can do 2 technologies for them in a single turn to completely surprise them. Some information about crawler 1v1: - lvl 2 crawler always beats a lvl 1 crawler with one technology - If all the crawlers are lvl 1, then it's Impact Drill > Replicate > Mechanical Rage (so Impact drill will beat everything)\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "The normal counter for early game crawlers is just matching them with Arclights. If the enemy starts developing more of them or teching them, the best option to go for is the Wraith, because it has multiple targets so the enemy cannot block the Wraith damage - it will always clear the crawlers. Other good options include Fire Badgers, Typhoons, Whirlwind Rhinos, Vulcans or any kind of fire Crawlers are hard to counter as it's not about buying the right counter but positioning everything correctly. One trick is to place a forward positioned fang in front of your Vulcan so all the enemy crawlers will run to that position. If they have replicate, sell your isolated units so they can't be farmed."
  },
  "Fang": {
    "image": "https://mechamonarch.com/wp-content/uploads/Fang.jpg",
    "used_against": [],
    "countered_by": [
      "Crawler",
      "Mustang",
      "Stormcaller",
      "Vulcan",
      "Typhoon",
      "Tarantula"
    ],
    "how_to_play": "Fangs are one of the chaff units in the that distract the opponent. There's also technologies for you to build damage dealing fangs but it's a bad idea. The main value of the fangs as chaff comes from two things; one, the portable shield technology that makes them survive two shots. For it to be useful late game, you need to start setupping your fangs early. Two, the slow movement speed of the fangs allow them to walk very slowly in front of your critical units at the end stages of the round. The starting setup of the enemy determines if you want to build fangs as your chaff or not. They are good against Sledgehammer and Arclight starts especially. This is because once you get the shield tech, these units are stuck on them forever.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nMonitor mount for all desks Check Price\n\nWhy promotions?",
    "how_to_counter": "Countering fangs depend much about what other stuff the enemy has and how the fangs are deployed on the battlefield. So I cannot give you a definite answer here. Early game you can just run through fangs with crawlers or mustangs (especially with explosive ammo), bomb them with Stormcallers (even more effective with fire/high-explosive ammo). Against shielded fangs you eventually need fire, Vulcans, Typhoons or Mustangs."
  },
  "Fire Badger": {
    "image": "https://mechamonarch.com/wp-content/uploads/fire-badger.jpg",
    "used_against": [
      "Crawler",
      "Fang",
      "Mustang"
    ],
    "countered_by": [
      "Sabertooth",
      "Fortress",
      "Hacker",
      "Marksman",
      "Overlord",
      "Phoenix",
      "Rhino",
      "Scorpion",
      "War Factory"
    ],
    "how_to_play": "The Fire Badger is a rare unit that you can only get from the free unit packs. I pick this guy quite often since it's always the best economy of the unit pack. And it's very strong against crawlers since it absolutely demolished them and doesn't require any technologies. Against fangs and mustangs you might need range but I think it's better to use the Fire Badger only against crawlers. Sometimes a very strong flanker as the enemy might have piled up chaff in the corner and you can pull and kill them all. You can use the fire badger very similarly to sledge hammers. It serves as your fronline tank for your damage units and clear all the chaff along the way.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "When you see the badgers, build fangs as chaff instead of crawlers since the Fire Badger has a short range. In the midgame you can use for example armored sledgehammers to tank the damage or go straight into Fortresses or what not."
  },
  "Rhino": {
    "image": "https://mechamonarch.com/wp-content/uploads/Rhino.jpg",
    "used_against": [
      "Arclight",
      "Vulcan",
      "Stormcaller",
      "Crawler",
      "Sledgehammer",
      "Fire Badger",
      "Marksman",
      "Mustang",
      "Typhoon"
    ],
    "countered_by": [
      "Fortress",
      "Hacker",
      "Melting Point",
      "Steel Ball",
      "Phoenix",
      "Overlord",
      "War Factory"
    ],
    "how_to_play": "It's and aggressive unit that needs to be played aggressively. I mostly use them for shielding my damage dealers. If you are building crawlers for example and the enemy has a Vulcan, you can drop the rhino in front of the Vulcan to draw the aggro and let the crawlers do the work. Rhinos are also great at taking down enemy towers. To accomplish this, you need to push your opponent from multiple directions, pulling his forces away from the command tower thus finding a nice angle for the Rhino mobile beacon. Rhinos different techs make the unit very flexible. There's so many tech paths that it's up to your imagination how do you want to use the unit.\n\nvideo\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "Against aggressive rhinos I usually build charged shot phoenix or steel balls deployed vertical to the rhinos. Sometimes a Fortress. If the rhino is high level and has some crazy item, I might build a Melting Point. When you see a rhino deployed, you need to start thinking about where it can be mobile beaconed and drop stuff in all its possible paths. You can drop sentry missiles on it as they slow it down. Keep in mind it's later negated by the power armor tech. If it's round 2 or 3, you might want to start with a hacker. Do keep in mind you need some damage, like a phoenix to soften it up and something like fangs to keep it in place. If you already have phoenixes, getting jump drive and moving them in the perfect position helps a lot. Overlord with ground cannon is also a solid choice. Keep in mind that they can tech the final blitz tech to explode the rhino, so don't stack too much stuff in one place. If this happens, you can try to keep the rhino in place and shield the explosion (the rhino must not get under the shield). EMP can counter the final blitz for one round, but after the enemy sees it, he will buy photon coating which negates the EMP effect. Shielded fangs waste a lot of time for the enemy, even if they have Whirl Wind on their Rhinos. If you are getting Rhino flanked, dropping an early War Factory that shoots in all directions is very powerful."
  },
  "Scorpion": {
    "image": "https://mechamonarch.com/wp-content/uploads/Scorpion-1.jpg",
    "used_against": [
      "Sledgehammer",
      "Steel Ball",
      "Arclight",
      "War Factory"
    ],
    "countered_by": [
      "Marksman",
      "Phoenix",
      "Stormcaller",
      "Overlord"
    ],
    "how_to_play": "The Scorpion's best use case is to counter Steel balls. The second best is to counter Sledgehammers, but sometimes in that scenario the enemy has a very easy switch into Overlords and that's usually a very scary situation. The scorpion is also good vs enemy shields/barriers. The key of using Scorpions is to pair them with good chaff clear; Vulcans or mustangs. I find it to be a big mistake to overcommit into this unit too early. It's usually best just to get one of them without any technologies and chill for 1-2 rounds and see what the response is. Later in the game you can mass these and go range+acid and it's very strong. Even one scorpion will tank a good amount of damage early game and kill the one unit you have a problem with (f.e. lev2 balls/sledge). The scorpion is also very good against the War Factory. The attack damage from the scorpion destroy all the summons and the acid attack will deal with the factory itself. The scorpions can counter giants but are not that good against them, you usually lose to fortresses and melting points if the enemy masses them.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "First of all you shouldn't commit too heavily into Sledgehammers or Steelballs in the early game to give the opponent a very easy out to buy a scorpion. The biggest counter of the scorpion is the Overlord. Scorpion is also very weak to crawlers. The moment you see scorpions, it is a good idea to start looking into how you can get to overlords. Either build them immediately or delay a round by buying a bunch of crawlers to distract the Scorpion."
  },
  "Raiden": {
    "image": "https://mechamonarch.com/wp-content/uploads/raiden.jpg",
    "used_against": [
      "Fire Badger",
      "Sledgehammer",
      "Steel Ball",
      "Stormcaller"
    ],
    "countered_by": [
      "Farseer",
      "Marksman",
      "Melting Point",
      "Overlord",
      "Phoenix"
    ],
    "how_to_play": "The Raiden is like a flying Scorpion. It counters all medium units very well and early on struggles against high health targets. It will eventually counter everything once you get some levels and items on it. Try to look for an over commitment of medium sized units from your enemy like sledgehammers, fire badgers, phantom ray, steel balls etc. and get your Raiden going from that point. If they level and you find items you can just keep committing more into them.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nHoly Moly - RAT T-shirt Check Price\n\nWhy promotions?",
    "how_to_counter": "The Raiden will struggle heavily against chaff early game. So building large numbers of crawlers while killing the Raidens with a single anti-air unit while they are distracted it a good way to start countering them. This will allow you to have some time to build into a proper counter like Overlords. The Raiden can also be countered by Marksmen and Phoenix but you need to be ahead on the chaff clear. Melting Points are also sometimes amazing but usually leave you vulnerable against medium units like Sledgehammers. Fortress Anti-air is a good option if you can get there early enough. With the Forts you usually have to be building them on the same turn or before the enemy is in Raidens (also depends a little bit on items and some skills like intensive training)."
  },
  "Typhoon": {
    "image": "https://mechamonarch.com/wp-content/uploads/typhoon.jpg",
    "used_against": [
      "Crawler",
      "Fang",
      "Wasp",
      "Mustang"
    ],
    "countered_by": [
      "Fortress",
      "Marksman",
      "Melting Point",
      "Overlord",
      "Phoenix",
      "Rhino",
      "Sabertooth",
      "Scorpion",
      "Steel Ball",
      "War Factory"
    ],
    "how_to_play": "Typhoon is a rare unit you can only get from the free unit packs. It's a bigger version of the Mustang that is fairly tanky. It's like a scorpion that kills chaff instead of big units. Very strong against crawlers, fangs and wasps and like mustang, can deal a lot of damage to bigger things but require items and levels to do so. It doesn't have a range technology available, but it has barrier technology and you need to use it as part of your frontline. With the short range, it's best used as an aggressive unit or defender of aggression.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "You can block the damage of typhoons with any kind of medium units but the best counters for it are Steel Balls, Fortresses or Scorpions. I find steel balls to be very good since they are good against the barrier that might be teched and because you can put them in front of your late crawlers so they come to the battle together and the balls are protecting the crawlers. Hackers would otherwise be good against the typhoons, but they struggle against the barrier sometimes."
  },
  "Vulcan": {
    "image": "https://mechamonarch.com/wp-content/uploads/Vulcan.jpg",
    "used_against": [
      "Crawler",
      "Fang",
      "Mustang"
    ],
    "countered_by": [
      "Fortress",
      "Melting Point",
      "Overlord",
      "Phoenix",
      "Rhino",
      "Stormcaller"
    ],
    "how_to_play": "The Vulcan is relatively cheap considering it just clears everything small. The success of the Vulcan depends a lot of all the enemy chaff is located or can be pulled in a single position. You can deploy forward fangs in front of the vulcan to draw attention of the enemy chaff to it. Don't use Vulcan against aggression, go Wraith instead. Vulcan is also good vs medium units like Steelballs/Sledges with the +125% attack upgrade (+counters mechanical division). Pair the Vulcan with single target damage like Phoenix, Maskman, Overlord or Melting Point. Both health and damage items are great with the Vulcan. Picking up a cheap haste module early is a good way into a Vulcan.\n\nvideo\n\nvideo end\n\nHoly Moly - RAT T-shirt Check Price\n\nWhy promotions?",
    "how_to_counter": "When the enemy goes Vulcan, you go Fortress. Melting Point is also a solid choice. If you are already in Steel Balls, you will outscale the vulcan with Energy Absorption, some levels and Photon Coating Overlords. Armored Sledgehammers are also a good way to block the vulcan."
  },
  "Wraith": {
    "image": "https://mechamonarch.com/wp-content/uploads/wraith.jpg",
    "used_against": [
      "Crawler",
      "Fang",
      "Sledgehammer",
      "Steel Ball",
      "Wasp"
    ],
    "countered_by": [
      "Overlord",
      "Phoenix",
      "Melting Point",
      "Marksman"
    ],
    "how_to_play": "The best use case for the wraith is to clear crawlers since the wraith's damage cant be blocked by other units because it has multiple targets at once. Due to it's short range, it's best used as a very aggressive unit or defender against aggro. All items are really strong on the wraith as it shoots multiple different targets. It doesn't overkill by much so all the damage items are great and it has a high hit point pool so all the health items are good as well. If you are using it offensively, the movement speed from haste module is very strong. If you use the wraith as an aggressive unit, you definitely need the range technology on it pretty fast. Without it, it will walk too forward and die to the counter enemy has setup for it.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "Don't deploy too much aggressive chaff in one place. Sledgehammers are quite good \"chaff\" against the wraith early on, since it takes quite a while for it to clear them and the wraiths are often paired with a lot of crawlers against which the sledges shine. If the enemy techs a very early degenerate beam, go photon boat to counter the effect and kill the wraith. Aerial spec marksmen are very strong against wraiths and so are melting points and charged shot phoenix. If they have already teched degenerate beam on it, going aerial spec wasps is a good option, since the range becomes very expensive for them. The wasps will outscale the wraith very hard in the late game."
  },
  "Sandworm": {
    "image": "https://mechamonarch.com/wp-content/uploads/sandworm.jpg",
    "used_against": [
      "Fire Badger",
      "Arclight",
      "Marksman",
      "Rhino",
      "Sabertooth",
      "Sledgehammer",
      "Steel Ball",
      "Typhoon",
      "Vulcan",
      "Tarantula",
      "Mustang"
    ],
    "countered_by": [
      "War Factory",
      "Phoenix",
      "Overlord",
      "Steel Ball",
      "Melting Point",
      "Rhino"
    ],
    "how_to_play": "The best use case for the sandworm is to protect your Wasps with sandstorm against Mustangs and Fortress anti-air. It's also very usable in long range games featuring lots of stormcallers and vulans. You can beacon the worm around and it submerges later in the round to kill the remaining storms. In asymmetrical games you can also go for a lot of worms in the same position and use replicate to continuously produce a new army. It's critical that all your firepower is concentrated on a single spot so the worms will burrow and unborrow more often.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "Most of the sandworm's tech kit reaches it's full potential when the sandworm can burrow and emerge from underground multiple times per round. You can pin down the sandworm in place with lots of chaff drip fed chaff heading its way. War Factory just absolutely demolishes the enemy worms. Fortress with launcher overload is also a strong option. Steel balls and Melting points for too but sometimes they get distracted by replicate/sandstorm. Overlords with ground cannon is a great way to deal with them aswell. Scorpions with acid work also since the enemy cannot photon his worms as they burrow and dodge the photon emission. Phoenix with charged shot also have usually enough damage to bring the worm down."
  },
  "Phantom Ray": {
    "image": "https://mechamonarch.com/wp-content/uploads/phantom-ray.jpg",
    "used_against": [
      "Fire Badger",
      "Hacker",
      "Mustang",
      "Sledgehammer",
      "Steel Ball",
      "Stormcaller",
      "Typhoon",
      "Wraith"
    ],
    "countered_by": [
      "Farseer",
      "Marksman",
      "Melting Point",
      "Overlord",
      "Phoenix",
      "Raiden"
    ],
    "how_to_play": "The Phantom Ray serves as a frontline for your air army. The Phantom Ray is good damage medium sized units like sledges, steel balls etc. and good vs rapidly shooting units like mustang (because of armor technology). I would only build this unit to brick enemy mustangs by teching the armor technology. This will give a free round and a big problem for your enemy do deal with. After you brick the mustangs, the enemy will counter it will marksmen or phoenix and you can tech the shield technology for them to counteract this. The Phantom Ray has extremely diverse tech pool and can serve as a huge damage dealer also. I don't think it's good to start the unit that way but once you have them on board with armor, you always have the opportunity to build 3 more and use them as damage later on in the game.\n\nvideo\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "Don't overcommit into fast shooting units too early so you don't get owned by the armor. Countering them depends a lot on which technologies they click. Early on low amounts of Marksmen and Phoenix are a good choice. You just need to win the chaff war. If the enemy is actually massing them the best option is just to go Overlords or Anti-air wasps. Multi melter or just a regular melter with energy absorption is also a solid choice if you get it from the unit drop. If the enemy has no damage apart from the Phantom Rays you might want to go into missile interception mustangs."
  },
  "Hacker": {
    "image": "https://mechamonarch.com/wp-content/uploads/Hacker.jpg",
    "used_against": [
      "Steel Ball",
      "Sledgehammer",
      "Rhino",
      "Scorpion",
      "Melting Point",
      "Fire Badger",
      "Arclight"
    ],
    "countered_by": [
      "Overlord",
      "Fortress",
      "Stormcaller",
      "Crawler",
      "Fang",
      "Phoenix",
      "Wraith",
      "War Factory"
    ],
    "how_to_play": "The hacker is a risky unit that works against very different kinds of boards. It can either steal something relevant from the opponent or it can steal small units all the time that distracts their whole army. It's strong early on against Sledgehammers, Steel Balls, Rhinos, etc. but you need a same level hacker for it to hack reliably. Don't pair the hacker with strong single target damage since the single target damage will kill the targets the hacker is hacking and you won't be able to control them. The hacker is good against Scorpions and Melting Points since both of these units will become very distracted by the hacked units and just spin around without doing anything. In these kinds of situations the hacker is the better, the less enemy has fast chaff clear (like Mustangs or Vulcans). So if the clear chaff with for example Arclights or Slegehammers, the hacked unit will distract the enemy army a lot longer. If you go hackers early game you should pair them with something that kills barriers fast (like storms) so you won't get countered by them on the next round.\n\nvideo\n\nvideo end\n\nPC Gaming Headset Headphone Hook Holder Check Price\n\nWhy promotions?",
    "how_to_counter": "If the enemy hackers appear very early, going heavy on chaff is the way to go. This way the hacker is just distracted and eventually dies. In the midgame the biggest enemy of the hacker is a Barrier. The shield prevents the hacker from hacking anything, so going Fortresses with the barrier tech or just buying a 100 cost personal shield is the best option. In late game when the enemy has shield break and chaff clear covered, you need to make sure you yourself kill your hacked units as fast as possible. This might mean going Mustangs or Vulcans or even Overlords with ground cannon."
  },
  "Mustang": {
    "image": "https://mechamonarch.com/wp-content/uploads/Mustang.jpg",
    "used_against": [
      "Fang",
      "Phoenix",
      "Wasp",
      "Crawler"
    ],
    "countered_by": [
      "Arclight",
      "Sledgehammer",
      "Stormcaller",
      "Vulcan",
      "Fortress",
      "Rhino",
      "Fire Badger",
      "Typhoon",
      "Tarantula"
    ],
    "how_to_play": "Mustangs are a solid all-around unit that can be teched to fit many different purposes. You can certainly use them as your army's main damage dealer. Early on they are excellent against fangs and ok against crawlers and provide protection against early air. Later on when they get levels and are equipped with a damage item, they kill everything. Their high speed allows you to deploy them to cover your flanks even when you are pushing with other units. When approaching late game, be careful not to build too many of them, as they require support when enemy starts building their counters. Once you have 3-4 packs of them, it's best to keep investing into supporting units. Mustangs biggest enemies are armor technologies, big units and shields. Pair them with hackers, fortresses, steel balls or rhinos.\n\nvideo\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "There's lots of ways to counter the mustangs. In the early game it's usually convenient to build Arclights or Sledgehammers since they will do a double role of clearing chaff also. Stormcallers are also very good if the enemy has paired the mustangs with fangs or other slow units. In the mid and late game you should look to pin down the enemy Mustangs with Armor technologies or giant units. I usually go Armored Sledges or Fortresses with barrier to lock them down. After they have already targeted your bigger units, your smaller units (what the mustangs where deployed to counter) like wasps or crawlers can do some work without dying. If you are approaching late game and the enemy has leveled and itemized their mustangs, consider something like a Vulcan with incendiary bomb and melting point + EMP to clear the shields for the fire to land."
  },
  "Sledgehammer": {
    "image": "https://mechamonarch.com/wp-content/uploads/Sledgehammer.jpg",
    "used_against": [
      "Crawler",
      "Mustang",
      "Stormcaller"
    ],
    "countered_by": [
      "Hacker",
      "Fortress",
      "Phoenix",
      "Overlord",
      "Scorpion",
      "War Factory",
      "Marksman",
      "Rhino"
    ],
    "how_to_play": "The sledgehammer is an early game chaff clear unit that does very well against crawlers and fangs. Throughout the game they are very good versus crawlers but get stuck on shielded fangs for eternity. In the midgame, the role of the sledgehammer is to assist in chaff clear as well as provide a frontline for your bigger units. During this stage of the game the enemy has instant clear for your crawlers/fangs with units like Typhoons, Vulcans, Wraiths etc. and the sledgehammer can tank all them very well. While they are an early game powerhouse, you should not tech your sledges too early as they are hard countered by multiple units (f.e. scorpions, fortress, overlords). In a late game composition they offer a lot of options. They can tank enemy melting points for a long time, they can nullify mustangs completely with armor enhancement tech and they can clear crawlers fast and offer solid damage boost in general to your whole composition. When enemy leans a bit too heavily on Stormcallers, going sledges + crawlers is a very good option. Sledges struggle against storms for a round but once you get speed or mechanical rage they do well. Against Steelballs, it's usually better to deploy the sledges vertically as all the balls will start drilling on the first sledge instead of all focusing on their own target. Keep in mind that not leveling your sledgehammers is often correct. Most of the sledgehammer counters are bad versus level 1 sledges since they are tied to that position and overkill them by quite a bit. And level 1 sledges do their main role similarly compared to higher level sledges; they still clear chaff the same and they still get one shot by a scorpion.\n\nvideo\n\nvideo end\n\nMonitor mount for all desks Check Price\n\nWhy promotions?",
    "how_to_counter": "Don't build too many crawlers and lean more into fangs so you have the option to tech fang shield later. Going charged shot arclight might be a good option if the enemy also has a lot of crawlers or leveled crawlers. Scorpions are a solid choice against sledgehammers but unlocking them too early leaves you very vulnerable to overlords. Fortresses are very good against the sledgehammers and if the sledges are paired with something like marksmen/arclight/phoenix/wasp, the fortress will counter them also with either anti-air tech or summoning shielded fangs. War Factory is another option in a similar scenario. If the enemy fails to build chaff and just keeps building sledges, round 4-5 factory will be very strong. There's some more niche counters like hacker, but its not good unless you get it free from the unit drops. If the enemy sledges develop the damage sharing technology, counter them with a Melting Point."
  },
  "Steel Ball": {
    "image": "https://mechamonarch.com/wp-content/uploads/SteelBall.jpg",
    "used_against": [
      "Fortress",
      "Rhino",
      "Melting Point",
      "Vulcan",
      "War Factory",
      "Fire Badger",
      "Typhoon"
    ],
    "countered_by": [
      "Crawler",
      "Hacker",
      "Phoenix",
      "Overlord",
      "Stormcaller",
      "Scorpion"
    ],
    "how_to_play": "Steel Balls are quite vulnerable as starting units as they are heavily countered by a free Scorpion unit drop. As a reactionary unit they shine a lot. They can provide a good frontline to your backline damage dealers or even tank for your late crawlers. Use Steel Balls against big single targets like Melting Points, Typhoons, etc. Once they get some levels and items they are pretty much unstoppable. And once the enemy thinks they can finally kill them, go photon emission Overlord to boost them even more.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nPC Gaming Headset Headphone Hook Holder Check Price\n\nWhy promotions?",
    "how_to_counter": "Steel balls can be played and countered in many different ways. The most universal option is Scorpion. An early scorpion will stop the leveling of the steel balls making it so they don't get out of hand. You can also use Overlords with Ground Cannon or Launcher Overload, Hackers or Arclights with charged shot. You can also slow them down with a Degenerate Beam Wraith. The Wraith is in general good against other units a player might have paired up with his Steel Balls. If the enemy is deployed aggressively, you can use sentry missiles to kill steel balls that are about to level in early rounds. You can do this by placing the missiles on top of your tower so it won't trigger to the crawlers in front of the balls. If defending against a steel balls push, you can deploy fangs vertically in front of your tower so that all the enemy balls will gather around and then you blast them with 2 packs of storm callers (this is what I do most often) Phoenix work well if you can connect to them fast enough. If the steel balls level, you need charged shot tech. Keep in mind you need enough chaff clear to connect to the Steel Balls. Steel Balls are often paired with Wraiths that are strong against crawlers. If this is not the case, overwhelming them with crawlers is an easy option. Vulcan with damage technology or damage item is also a good option (your vulcan needs to be the same level as the balls for it to not become risky)"
  },
  "Stormcaller": {
    "image": "https://mechamonarch.com/wp-content/uploads/Stormcaller.jpg",
    "used_against": [
      "Arclight",
      "Fang",
      "Melting Point",
      "Vulcan",
      "Mustang",
      "Marksman",
      "Fortress",
      "Scorpion",
      "Typhoon"
    ],
    "countered_by": [
      "Overlord",
      "Phoenix",
      "Stormcaller",
      "Crawler",
      "Sledgehammer",
      "Rhino",
      "War Factory",
      "Sabertooth"
    ],
    "how_to_play": "If unopposed, Stormcallers are one of the best units in the game. They melt down all low hp units like fangs and mustangs and they are also great against slow or stationary targets like giants, sledge hammers, marksmen and arc lights. They are also one of the best unit to bring down enemy shields. Thus they counter almost everything. They get heavily countered by the missile interceptor device (and missile interception technologies) and it's a delicate balance to know when and how many Stormcallers you should buy. In early game, it's totally acceptable to buy 2-4 packs or Stormcallers. You should fear anti-missile devices or War Factory Anti-missile tech coming down so, don't go more into them, think twice about leveling them and never put items on them. When approaching late game, don't base all your chaff clear on storms since you will lose a big round when the AM technologies/devices come down. What prompts me to use Stormcallers most often is enemy placing multiple fangs in front of his units and him having a fairly slow board all together;  sledges, giants, fangs, etc.\n\nvideo\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "If there a only a couple of stormcallersm they can be heavily countered by anti-missile devices, but they are risky to build early as you lose a lot of economy if they are destroyed. Late game you should mass them against Stormcallers. If the enemy has crazy amounts of Stormcallers or multiple high leveled or teched ones, consider going War Factories with the Missile Interception technology. Cost efficiently, Stormcallers can be distracted with a couple packs of crawlers running around taking all the missiles will grant your other units time to move forward unharmed (or for your shields to survive). You can also put one crawler in the middle of the board an mobile beacon it to move side ways (you can beacon half of the crawlers only so they don't die to one sentry missile). Building the one round speed upgrade also helps a lot. Sledgehammer is a good starting unit vs storm callers. They struggle a bit early but once you get Field Maintenance or Mechanical Rage and level 2 on them, they keep going without dying."
  },
  "Farseer": {
    "image": "https://mechamonarch.com/wp-content/uploads/farseer.jpg",
    "used_against": [
      "Wasp",
      "Wraith",
      "Sledgehammer",
      "Steel Ball"
    ],
    "countered_by": [
      "Fortress",
      "Rhino",
      "War Factory"
    ],
    "how_to_play": "The Farseer offers a huge power spike mid game, but after that it quickly falls off. It's best on rounds ~3-5. This unit is a bit of do it all, it has okayish chaff clear, it has enough damage to kill sledges and balls and it prevent enemy Wasp plays, is good against Wraith and counters Overlord the turn it comes out. So it protects you from random cheese plays. If you make the mistake of teching this unit and building more of them, you will find yourself losing to better units later in the game. I would never even tech the range on these guys. EMP is sometimes good since it's very cheap. Only build 1-2 more in the mid game and then forget about the unit. If you are pushing, disabling enemy vulcan, wraiths or melting points with farseer EMP might be a very strong play. In long range games I don't think it works because then you need the range tech and you will probably not connect to the giants since you spent so much money teching the far seer and now you are behind on something else.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nHoly Moly - RAT T-shirt Check Price\n\nWhy promotions?",
    "how_to_counter": "Don't build too many wasps, phoenix or wraith in the mid game to give enemy a good opportunity for a Farseer. Go faster into giants when you see these on the board. Depending on your position, rhinos are also very good sometimes. Normal anti-missile devices don't work that well but a Factory does wonders."
  },
  "Marksman": {
    "image": "https://mechamonarch.com/wp-content/uploads/Marksman.jpg",
    "used_against": [
      "Phoenix",
      "Overlord",
      "Vulcan",
      "Arclight",
      "Sledgehammer"
    ],
    "countered_by": [
      "Crawler",
      "Fang",
      "Stormcaller",
      "Wasp",
      "Fortress",
      "Rhino"
    ],
    "how_to_play": "When both players play the start passively and deploy units near their towers, it's going to be a game of who has the biggest range and that's where marksmen shine. Keep in mind it important that they connect their high damage shots to valuable targets. That's why even in late game 4-5 marksmen is enough. It's all about who can handle the small stuff (crawler/fang/whatever) in front faster. If it makes sense to buy these early they will get levels quite fast and they are cheap to level so you don't miss deployments because you are leveling your units. You cannot switch into marksmen later on in the game. At that point it's better to build phoenix since you get two of them per deployment. Strong especially against Wraith in the midgame with the aerial spec tech.\n\nvideo\n\nvideo end\n\nAssman Deskmat Check Price\n\nWhy promotions?",
    "how_to_counter": "Just overwhelm the marksmen with crawlers, fangs or wasps. Two Stormcallers early game do wonders. If you identify the enemy overcommitting into marksmen early game, you can switch to rhino flanks or other forms of aggression and the marksman player cannot really stop it. If the enemy is pushing with assault marksmen technology, go Fortress or Scorpion (not EMP hackers or EMP Stormcallers or any other unreliable counter people on the internet keep suggesting!)"
  },
  "Overlord": {
    "image": "https://mechamonarch.com/wp-content/uploads/Overlord.jpg",
    "used_against": [
      "Rhino",
      "Steel Ball",
      "Sledgehammer",
      "Stormcaller",
      "Vulcan",
      "Arclight",
      "Hacker",
      "Scorpion",
      "Fire Badger",
      "Sabertooth",
      "Typhoon",
      "War Factory",
      "Wraith"
    ],
    "countered_by": [
      "Marksman",
      "Melting Point",
      "Phoenix",
      "Mustang",
      "Fortress"
    ],
    "how_to_play": "The overlord is a backline damage dealer that needs to be protected. Pairing them with Rhinos, Steel Balls or Sledge Hammers is a good idea. The Overlord puts a lot of pressure on the enemy tower and is countered by long range shooters like Phoenix and Marksmen. Because of this it's best used as an aggressive unit and not in a \"standard\" long range game.\n\nvideo\n\nvideo end\n\nPC Gaming Headset Headphone Hook Holder Check Price\n\nWhy promotions?",
    "how_to_counter": "Just like with any giants, keeping it busy with crawlers or fangs is always critical. To eventually kill the overlord, you need marksmen, phoenixes Melting Points or Aerial spec Mustangs. Then there will be wasps and you need fortress or mustang for them."
  },
  "Phoenix": {
    "image": "https://mechamonarch.com/wp-content/uploads/Phoenix.jpg",
    "used_against": [
      "Arclight",
      "Overlord",
      "Rhino",
      "Stormcaller",
      "Vulcan",
      "Typhoon",
      "Sabertooth",
      "Fire Badger",
      "Scorpion"
    ],
    "countered_by": [
      "Wasp",
      "Marksman",
      "Mustang",
      "Fang",
      "Fortress"
    ],
    "how_to_play": "Phoenixes are a very good harassment unit early game with jump drive. You can flank with them, move them around to positions where there is less anti air. Or to move them to counter cards like summon overlord. I use them to counter different pushes as they can move to different locations where you can immediately connect to big units. You can also use them as long range damage dealers in your backline. Compared to marksmen for example, they save you deployments since you get 2 of them on each pack. If you tech them too fast or build too many of them you are very vulnerable to Anti-Air Fortresses since they can shoot them through chaff.\n\nvideo\n\nvideo end\n\nPC Gaming Headset Headphone Hook Holder Check Price\n\nWhy promotions?",
    "how_to_counter": "The Phoenix has quite a many early game counters like fangs, mustangs or marksmen. Later on, Fortresses with Anti-Air Barrage might be a good choice as well depending on what the phoenix is paired with. If the fortress counters the other unit type as will it's definitely a great choice (sledghammers, vulcans, fire badgers etc.) The anti-air connects to the phoenix although there is other units in front of it. Wasps can be good either just to tank the phoenix damage or to kill them with the aerial specialization technology."
  },
  "Wasp": {
    "image": "https://mechamonarch.com/wp-content/uploads/Wasp.jpg",
    "used_against": [
      "Marksman",
      "Phoenix",
      "Melting Point",
      "Vulcan",
      "Overlord"
    ],
    "countered_by": [
      "Mustang",
      "Fortress",
      "Fang",
      "Wraith",
      "Typhoon",
      "Tarantula"
    ],
    "how_to_play": "Wasps can be played in many different ways depending on the board state and your technology choices. In early game you can use Wasps as a harassment unit with jump drive and mobile beacon. It's very effective if the enemy has holes in his defense. Later on you can add Rhinos or Steel Balls in front of them to power through the defenses or just switch to defensive formation and jump drive the wasps back and tech shields for them and use them as meat shields. You can use them as your main damage deal unit as they deal insane amount of damage with ground/air specializations. They are very squishy though and you need to protect them by building a solid frontline. The key in this strategy is to get early levels on the Wasps so they are a menace with items. In later rounds you can't block damage coming to them with frontline units and the only way is to go elite marksmen/range on them to keep them safe. Most often Wasps are just used as meat shields. They are good vs leveled Marksmen and Melting Points in particular. One good trick is also to use them to block sentry missiles. The missiles have a big splash radius and if you have clumped up ground units who would all die, you can tank the missile with wasps and the splash will hit only air units. They scale into the late game very well and are the perfect counter for mass overlord or wraith strategies. Against Wraith you struggle in the mid game but once you get your techs going (Range + Aerial Spec) you should defeat them easily. If you have ground specialization on your Wasps, you can use it early game to farm leveled enemy ground units to gain fast levels on your own Wasps. Wasps are also very strong flank defenders if enemy has already committed multiple units in your flank. They will fend off most units and fly to the battle fast after doing so. Also, the aerial specialization will instantly target any air units in your flank. The enemy cannot block it.\n\nvideo\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "In the early game, you should buy Mustangs when you see the Wasps come out. Wraiths can also be good if the enemy has a lot of crawlers paired with the Wasps. (and rare Typhoons if you get them from the unit drop) In the mid and late game, Fortresses with Anti-air barrage is the best option. This is because the Wasps are often paired with a mobile frontline like the Steel Ball, so the Fortress will fend off both of these units. After you tech the anti-air on the Forts the enemy usually tries to block it with bigger air units like Field Maintenance Wraiths so you might need to go Aerial spec marksmen, charged shot phoenix or a Melting Point also. Depending on the situation and the technology palette of the enemy Wasps, going your own Waps with Aerial spec and range might be really good also. If the enemy is using Wasps as a chaff unit to block your phoenix or Marksmen and you already have a bunch of fangs as chaff units, it's usually better to tech range for the fangs to kill the wasps than to invest in another unit type like Mustangs."
  },
  "Fortress": {
    "image": "https://mechamonarch.com/wp-content/uploads/Fortress.jpg",
    "used_against": [
      "Arclight",
      "Rhino",
      "Sledgehammer",
      "Vulcan",
      "Wasp",
      "Hacker",
      "Overlord",
      "Phoenix",
      "Typhoon",
      "Scorpion"
    ],
    "countered_by": [
      "Crawler",
      "Melting Point",
      "Overlord",
      "Stormcaller",
      "Steel Ball"
    ],
    "how_to_play": "The Fortress is a very versatile giant. It can be teched to deal with a lot of different board states. You can use a few of them, you can level them or you can go wide and mass them with no levels and fang summoning technology. Look to go Fortresses against Sledgehammers, Typhoons, Firebadgers and any other medium units. Very strong against Vulcans because you can shield the inevitable fire and the Fortress itself demolishes the Vulcans quickly. Most air units need medium sized units in front of them so the Fortress is strong because it counters the air units with Anti-air barrage and the demolishes the tanking units with it's attack. If your enemy starts teching phoenix early or builds 3+ of them, it's usually an easy out to go Anti-air Fortress since they are dependent on the Phoenix single target damage and once you take them out they cannot kill your Fortress. The Fortress is hard to counter since you have a lot of tricks with beaconing them elsewhere, teching barrier to prevent acid or EMP or spells and using fang summoning and fang shields to block high damage shots. If you play it correct, massing Fortress wins against mass overlords or any kind of Air army.\n\nvideo\n\nvideo end\n\nMonitor mount for all desks Check Price\n\nWhy promotions?",
    "how_to_counter": "The best counter to the Fortress is a Melting point, you will eventually need fire or mustangs to deal with the fang summoning. In a late game situation against Mass forts, going EMP Melters and indenciary Vulcans is a good idea. If you already are in Steel Balls, they are also a solid option to counter the Fortress. It's a bit of a 50/50 matchup and the outcome is dependent on who has the tempo and level/item lead. You can use War Factory anti missile to counter the Fortress anti-air barrage (or rocket punch for that matter but its more a niche case). Acid crawlers might be good if you manage to build them at a perfect time, but it's hard to get right."
  },
  "War Factory": {
    "image": "https://mechamonarch.com/wp-content/uploads/WarFactory-1.jpg",
    "used_against": [
      "Arclight",
      "Marksman",
      "Rhino",
      "Sledgehammer",
      "Steel Ball",
      "Vulcan",
      "Stormcaller",
      "Overlord",
      "Fire Badger",
      "Typhoon",
      "Sabertooth"
    ],
    "countered_by": [
      "Melting Point",
      "Scorpion"
    ],
    "how_to_play": "The best use case for the War Factory is to use is as a Missile interceptor device. It's very good at doing so since the intercepting effect doesn't diminish when the round goes on (like with the AM device). You can go shielded fangs to bait out a fire from stormcallers and immediately follow it up with a War Factory to intercept the missiles. It also works against Fortress anti-air barrage which is quite useful sometimes. The missile interceptor also works against Overlords but it's not usually good since they go launcher overload and overwhelm the factory. If this tech isn't available for them, going AM factory is a great choice. The unit has an upkeep of 200 per round, so it truly is a late game unit and I think it doesn't make any sense economy wise to start building them before round 5. If you deploy it too early, you will make your board vulnerable to flanks and lose economy in the progress. If you want to be proactive with the factory, you need to start with the summoning technologies and setup them early game somehow by using the same units and upgrading them. Or picking up improved steel ball/sledge/ball cards as the war factory will summon the improved versions. The summoning factory is easily countered because you lose so much economy in the process of building them so I wouldn't recommend it. The usual response to the factory is going acid scorpion or a melting point. Against the acid you can move it around with mobile beacon to further delay it going in harms way. Against the melter and the acid you can tech the range to actually shoot from the backline and kill the threats. Some undocumented features of the War Factory: - The spawned units will be the same level as your War Factory. - You can't equip an item on it.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nMost comfortable headphones for sleeping! Check Price\n\nWhy promotions?",
    "how_to_counter": "The best counter to the War Factory is usually a Scorpion with range/siege mode and acid. The second best is a Melting Point. If you already have leveled, agressively deployed  steel balls, they are enough if you commit harder to them. Vulcans with ignite is also a viable counter. If you are already into Fortresses, going fang summon and ignite on the fangs works as well. If you know your enemy is running the missile interceptor on their factories, don't commit hard into overlords or stormcallers and give him a perfect round to build his factories."
  },
  "Tarantula": {
    "image": "https://mechamonarch.com/wp-content/uploads/tarantula.jpg",
    "used_against": [
      "Fang",
      "Crawler",
      "Mustang",
      "Wasp"
    ],
    "countered_by": [
      "Fortress",
      "Hacker",
      "Marksman",
      "Melting Point",
      "Overlord",
      "Phoenix",
      "Rhino",
      "Sabertooth",
      "Scorpion",
      "Sandworm",
      "Steel Ball",
      "War Factory",
      "Stormcaller"
    ],
    "how_to_play": "The Tarantula has a couple of things going for it. It's very tanky and besides clearing chaff very well early game, it deals ok damage against Sledgehammers and Arclights especially. So look to use this unit against a board that is heavy in chaff and in addition to that has arcs or sledges. The tarantula needs to be a frontliner because you need to use the high amount of health to make it worth the price. It's not a unit you want to commit into. You want to never build more of them and use them as a solid early game without teching them. But if you really want to play this unit, do a Tarantula push by surrounding the enemy base with them. Go spider mine first. Due to the cheap armor technology it is also a very nice answer to mustang heavy boards.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nPC Gaming Headset Headphone Hook Holder Check Price\n\nWhy promotions?",
    "how_to_counter": "In early game, look how you could get into phoenix early and you have no trouble dealing with the Tarantula. Any kind of wasp play also forces the Tarantula player to deploy units he really doesn't want to deploy. The actual Tarantula is easy to deal with but the problem comes with the spider mines since it will distract all your heavy hitters. Vulcan + air units is a good way to deal with this. If the enemy is going super heavy into the Tarantula, going hackers with multihack will also win you the game. If you can get into Fortress early, that's good as well since the Tarantulas lack the damage to kill them."
  },
  "Sabertooth": {
    "image": "https://mechamonarch.com/wp-content/uploads/sabertooth-1.jpg",
    "used_against": [
      "Arclight",
      "Steel Ball",
      "Stormcaller",
      "Fire Badger",
      "Sledgehammer"
    ],
    "countered_by": [
      "Fortress",
      "Hacker",
      "Melting Point",
      "Overlord",
      "Phoenix",
      "Rhino"
    ],
    "how_to_play": "The Sabertooth is a rare unit you can only get from the free unit packs. Picking this will often get you the most economy value from the unit pack so it's always a solid choice. I would only build more of them if all of these are true: - Enemy has too few chaff or you have crazy chaff clear - Enemy has a decent amount of medium units like balls, sledges, arcs, snipers, etc. - Enemy has  2+ stormcallers and the storms fulfill a critical role for them, like clear your fangs or mustangs Don't try to use the missile interceptor against overlords if they have launcher overload available. A leveled sabertooth with an item is always a big powerhouse early game.\n\nvideo\n\n.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }\n\nvideo end\n\nPC Gaming Headset Headphone Hook Holder Check Price\n\nWhy promotions?",
    "how_to_counter": "Just overwhelm it with chaff. If you get missile intercepted, tech launcher overload."
  },
  "Arclight": {
    "image": "https://mechamonarch.com/wp-content/uploads/Arclight.jpg",
    "used_against": [
      "Crawler",
      "Fang",
      "Mustang",
      "Steel Ball",
      "Sledgehammer",
      "Fire Badger",
      "Typhoon"
    ],
    "countered_by": [
      "Marksman",
      "Stormcaller",
      "Rhino",
      "Overlord",
      "Fortress",
      "Phoenix",
      "Wraith",
      "War Factory",
      "Scorpion",
      "Sabertooth"
    ],
    "how_to_play": "Arclights are very strong against crawlers through out the game. Against fangs they are good early but struggle once the fang shield is teched. So don't build arcs against fangs, only versus crawlers. It's a good idea to pair your arclights with stormcallers, since storms are good versus everything that the arcs are weak to (fangs / fortress / scorpion / marksmen / etc.) With charged shot, they counter most medium units like sledgehammers and steel balls. If the enemy keeps feeding your arclights early game with medium units and chaff they will level quite quickly and there might be an out to go carry arcs with the Elite Marksmen technology.\n\nvideo\n\nvideo end\n\nAssman Deskmat Check Price\n\nWhy promotions?",
    "how_to_counter": "If you see enemy starting with arclights or building early arclights, don't build crawlers as your chaff unit - build fangs. This way you can get the shield technology for the later and lock the arclights in place. Keep in mind that the charged shot will counter all medium units so don't go too heavy on them if you see the enemy with arclights. It's ok to build a few sledges / balls to tank the arclights and try to bait out the charged shot and sell them. If you identify the enemy is trying to go carry arclights, exploit his lack of antiair by going some air units for force him off the arclights. This will buy you a little bit of time to get into Fortresses with fang summoning which will demolish any kind of carry arclight attempt."
  }
}